lib/sepa/xml_templates/soap/danske/get_bank_certificate.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:pkif="http://danskebank.dk/PKI/PKIFactoryService">
  <soapenv:Header/>
  <soapenv:Body>
    <pkif:GetBankCertificateIn xmlns:pkif="http://danskebank.dk/PKI/PKIFactoryService">
      <pkif:RequestHeader xmlns:pkif="http://danskebank.dk/PKI/PKIFactoryService">
        <pkif:SenderId/>
        <pkif:CustomerId/>
        <pkif:RequestId/>
        <pkif:Timestamp/>
        <pkif:InterfaceVersion/>
      </pkif:RequestHeader>
    </pkif:GetBankCertificateIn>
  </soapenv:Body>
</soapenv:Envelope>
