lib/sepa/xml_templates/soap/danske_get_bank_certificate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pkif="http://danskebank.dk/PKI/PKIFactoryService" xmlns:elem="http://danskebank.dk/PKI/PKIFactoryService/elements">
    <soapenv:Header/>
    <soapenv:Body>
        <pkif:GetBankCertificateIn>
            <pkif:RequestHeader>
                <pkif:SenderId></pkif:SenderId>
                <pkif:CustomerId></pkif:CustomerId>
                <pkif:RequestId></pkif:RequestId>
                <pkif:Timestamp></pkif:Timestamp>
                <pkif:InterfaceVersion></pkif:InterfaceVersion>
            </pkif:RequestHeader>
            <elem:GetBankCertificateRequest></elem:GetBankCertificateRequest>
        </pkif:GetBankCertificateIn>
    </soapenv:Body>
</soapenv:Envelope>
